
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Изменилось количество";
	
	ПересчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Изменилась цена";
	
	ПересчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(Строка, СообщениеДляПользователя)

	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СообщениеДляПользователя;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

